Reports/20191112_220525/BDD Feature/Cucumber Runner Test Suite/20191112_220525/requests/main/1.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-11-12T16:05:34.539Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <LanguageISOCode xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sLanguageName>Bengali</sLanguageName>\n        </LanguageISOCode>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 346,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:LanguageISOCodeResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:LanguageISOCodeResult>ben</m:LanguageISOCodeResult>\r\n    </m:LanguageISOCodeResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 163,
        "bodySize" : 346,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 849,
        "blocked" : -1,
        "send" : 0,
        "wait" : 0,
        "dns" : -1,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "1",
        "testObjectId" : "Object Repository/Country API/More Services/Language Code",
        "harId" : "173a1cb7-ea10-4be5-95ed-a3b45100d31b",
        "reportFolder" : null
      },
      "time" : 849
    } ],
    "comment" : ""
  }
}